Tekla.Structures.Analysis.AnalysisModelAnalysisProperties.AnalysisMethodEnum
Defines the analysis method.

Tekla.Structures.Analysis.AnalysisModelAnalysisProperties.AnalysisMethodEnum.FIRST_ORDER
The first order calculation method.

Tekla.Structures.Analysis.AnalysisModelAnalysisProperties.AnalysisMethodEnum.P_DELTA
The P-delta calculation method.

Tekla.Structures.Analysis.AnalysisModelAnalysisProperties.AnalysisMethodEnum.NON_LINEAR
The non-linear calculation method.